Example/SteadyFlow/Sumer1996/0/Tauf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    location    "100";
    object      Tauf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<tensor> 
600
(
(0 8.66074e-09 0 8.66074e-09 9.67486e-14 0 0 0 0)
(0 -5.08792e-11 0 -5.08792e-11 3.15368e-14 0 0 0 0)
(0 1.16533e-11 0 1.16533e-11 1.94048e-16 0 0 0 0)
(0 5.65375e-12 0 5.65375e-12 4.28021e-16 0 0 0 0)
(-4.03897e-25 -1.40848e-12 0 -1.40848e-12 4.47307e-16 0 0 0 0)
(-4.03897e-25 6.87857e-13 0 6.87857e-13 5.16648e-16 0 0 0 0)
(-4.03897e-25 1.59476e-12 0 1.59476e-12 5.27258e-16 0 0 0 0)
(0 1.23328e-12 0 1.23328e-12 5.25971e-16 0 0 0 0)
...
)
;

boundaryField
{
    inandouthalf11
    {
        type            cyclic;
    }
    inandouthalf12
    {
        type            cyclic;
    }
    inandouthalf21
    {
        type            cyclic;
    }
    inandouthalf22
    {
        type            cyclic;
    }
    top
    {
        type            zeroGradient;
    }
    walls
    {
        type            zeroGradient;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
