Example/SteadyFlow/Sumer1996/0/Taus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    location    "100";
    object      Taus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<tensor> 
600
(
(0 0.00804436 0 0.00804436 -0.124884 0 0 0 0)
(0 0.0153715 0 0.0153715 -0.198427 0 0 0 0)
(0 0.0185264 0 0.0185264 -0.190212 0 0 0 0)
(0 0.0161456 0 0.0161456 -0.180935 0 0 0 0)
(-2.36584e-18 0.016195 0 0.016195 -0.182616 0 0 0 0)
(-4.80219e-18 0.0165318 0 0.0165318 -0.182836 0 0 0 0)
(-4.79269e-18 0.0164756 0 0.0164756 -0.181563 0 0 0 0)
(0 0.0164012 0 0.0164012 -0.180612 0 0 0 0)
...
)
;

boundaryField
{
    inandouthalf11
    {
        type            cyclic;
    }
    inandouthalf12
    {
        type            cyclic;
    }
    inandouthalf21
    {
        type            cyclic;
    }
    inandouthalf22
    {
        type            cyclic;
    }
    top
    {
        type            zeroGradient;
    }
    walls
    {
        type            zeroGradient;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
