Example/SteadyFlow/Sumer1996/0/Ub_0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "100";
    object      Ub_0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
600
(
(2.17911e-06 5.47036e-12 0)
(2.15126e-06 1.10264e-11 0)
(2.15367e-06 1.12074e-11 0)
(2.15709e-06 1.12446e-11 0)
(2.1565e-06 1.12816e-11 0)
(2.15639e-06 1.13257e-11 0)
(2.15684e-06 1.13715e-11 0)
(2.15718e-06 1.14175e-11 0)
...
)
;

boundaryField
{
    inandouthalf11
    {
        type            cyclic;
    }
    inandouthalf12
    {
        type            cyclic;
    }
    inandouthalf21
    {
        type            cyclic;
    }
    inandouthalf22
    {
        type            cyclic;
    }
    top
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
