Example/SteadyFlow/Sumer1996/0/ddt0(Ub)
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "100";
    object      ddt0(Ub);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -2 0 0 0 0];

internalField   nonuniform List<vector> 
600
(
(-1.49362e-15 6.28942e-08 0)
(1.1456e-15 1.2487e-07 0)
(1.22938e-16 1.25548e-07 0)
(-1.03956e-16 1.2599e-07 0)
(8.99813e-18 1.26385e-07 0)
(1.35286e-17 1.26879e-07 0)
(-7.15893e-18 1.27396e-07 0)
(2.52576e-18 1.27911e-07 0)
...
)
;

boundaryField
{
    inandouthalf11
    {
        type            cyclic;
    }
    inandouthalf12
    {
        type            cyclic;
    }
    inandouthalf21
    {
        type            cyclic;
    }
    inandouthalf22
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    walls
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
