Example/SteadyFlow/Sumer1996/0/ddt0(alpha)
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "100";
    object      ddt0(alpha);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
600
(
7.24758e-11
-7.40449e-11
-4.32513e-12
6.48927e-12
-9.50253e-13
-6.27201e-13
7.18888e-13
1.70242e-16
...
)
;

boundaryField
{
    inandouthalf11
    {
        type            cyclic;
    }
    inandouthalf12
    {
        type            cyclic;
    }
    inandouthalf21
    {
        type            cyclic;
    }
    inandouthalf22
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           uniform 1.04154e-09;
    }
    walls
    {
        type            calculated;
        value           uniform 7.24758e-11;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
