Example/SteadyFlow/Sumer1996/0/ddt0(epsilon)
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "100";
    object      ddt0(epsilon);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -4 0 0 0 0];

internalField   nonuniform List<scalar> 
600
(
8.97518e-20
-2.4909e-19
-1.04111e-19
-5.05464e-20
-3.38859e-21
0
0
0
...
)
;

boundaryField
{
    inandouthalf11
    {
        type            cyclic;
    }
    inandouthalf12
    {
        type            cyclic;
    }
    inandouthalf21
    {
        type            cyclic;
    }
    inandouthalf22
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           uniform 0.000117196;
    }
    walls
    {
        type            calculated;
        value           uniform 2.62559e-71;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
