Example/SteadyFlow/Sumer1996/0/ddt0(k)
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "100";
    object      ddt0(k);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   nonuniform List<scalar> 
600
(
1.18335e-14
2.0726e-14
-9.21054e-17
3.53768e-19
9.65387e-20
6.8857e-20
3.66768e-20
3.62169e-117
...
)
;

boundaryField
{
    inandouthalf11
    {
        type            cyclic;
    }
    inandouthalf12
    {
        type            cyclic;
    }
    inandouthalf21
    {
        type            cyclic;
    }
    inandouthalf22
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           uniform 4.49581e-07;
    }
    walls
    {
        type            calculated;
        value           uniform 1.18335e-14;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
