Example/SteadyFlow/Sumer1996/0/ddt0(phia)
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "100";
    object      ddt0(phia);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
599
(
1.44127e-29
2.86324e-29
4.28854e-29
5.72044e-29
7.15495e-29
8.59322e-29
1.00342e-28
1.14789e-28
...
)
;

boundaryField
{
    inandouthalf11
    {
        type            cyclic;
        value           nonuniform List<scalar> 
300
(
-6.91281e-43
3.95308e-31
7.12991e-31
1.00333e-30
1.32431e-30
1.6516e-30
1.97634e-30
2.30269e-30
...
)
;
    }
    inandouthalf12
    {
        type            cyclic;
        value           nonuniform List<scalar> 
300
(
6.91281e-43
-3.95308e-31
-7.12991e-31
-1.00333e-30
-1.32431e-30
-1.6516e-30
-1.97634e-30
-2.30269e-30
...
)
;
    }
    inandouthalf21
    {
        type            cyclic;
        value           nonuniform List<scalar> 
300
(
-4.98043e-11
-4.9923e-11
-5.00393e-11
-5.01533e-11
-5.02648e-11
-5.03739e-11
-5.04805e-11
-5.05846e-11
...
)
;
    }
    inandouthalf22
    {
        type            cyclic;
        value           nonuniform List<scalar> 
300
(
4.98043e-11
4.9923e-11
5.00393e-11
5.01533e-11
5.02648e-11
5.03739e-11
5.04805e-11
5.05846e-11
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 0;
    }
    walls
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBackPlanes
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
