Example/SteadyFlow/Sumer1996/0/ddt0(phib)
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "100";
    object      ddt0(phib);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
599
(
4.99459e-13
5.01664e-13
5.02902e-13
5.04618e-13
5.06509e-13
5.08581e-13
5.10573e-13
5.12706e-13
...
)
;

boundaryField
{
    inandouthalf11
    {
        type            cyclic;
        value           nonuniform List<scalar> 
300
(
7.46035e-22
-5.72494e-22
-6.1466e-23
5.23346e-23
-4.66569e-24
-7.01134e-24
2.67968e-24
-1.38687e-24
...
)
;
    }
    inandouthalf12
    {
        type            cyclic;
        value           nonuniform List<scalar> 
300
(
-7.46035e-22
5.72494e-22
6.1466e-23
-5.23346e-23
3.51089e-24
8.25413e-24
-4.01386e-24
1.38687e-24
...
)
;
    }
    inandouthalf21
    {
        type            cyclic;
        value           nonuniform List<scalar> 
300
(
-4.9763e-11
-4.98813e-11
-4.99973e-11
-5.01108e-11
-5.02219e-11
-5.03306e-11
-5.04367e-11
-5.05404e-11
...
)
;
    }
    inandouthalf22
    {
        type            cyclic;
        value           nonuniform List<scalar> 
300
(
4.9763e-11
4.98813e-11
4.99973e-11
5.01108e-11
5.02219e-11
5.03306e-11
5.04367e-11
5.05404e-11
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 0;
    }
    walls
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBackPlanes
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
