Example/SteadyFlow/Sumer1996/0/nutb
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "100";
    object      nutb;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
600
(
2.08885e-17
5.65471e-17
1.24615e-19
2.94719e-20
1.2377e-20
3.5621e-21
1.09246e-21
9e-22
...
)
;

boundaryField
{
    inandouthalf11
    {
        type            cyclic;
    }
    inandouthalf12
    {
        type            cyclic;
    }
    inandouthalf21
    {
        type            cyclic;
    }
    inandouthalf22
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           uniform 0;
    }
    walls
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
