Example/SteadyFlow/Sumer1996/0/phia
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "100";
    object      phia;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
599
(
-2.66349e-29
-5.2913e-29
-7.92536e-29
-1.05717e-28
-1.32228e-28
-1.5881e-28
-1.85442e-28
-2.12145e-28
...
)
;

boundaryField
{
    inandouthalf11
    {
        type            cyclic;
        value           nonuniform List<scalar> 
300
(
-1.67494e-39
-7.31103e-31
-1.31866e-30
-1.85564e-30
-2.44934e-30
-3.05469e-30
-3.65535e-30
-4.25899e-30
...
)
;
    }
    inandouthalf12
    {
        type            cyclic;
        value           nonuniform List<scalar> 
300
(
1.67494e-39
7.31103e-31
1.31866e-30
1.85564e-30
2.44934e-30
3.05469e-30
3.65535e-30
4.25899e-30
...
)
;
    }
    inandouthalf21
    {
        type            cyclic;
        value           nonuniform List<scalar> 
300
(
-4.99873e-07
-5.00656e-07
-5.01424e-07
-5.02178e-07
-5.02916e-07
-5.03639e-07
-5.04348e-07
-5.05042e-07
...
)
;
    }
    inandouthalf22
    {
        type            cyclic;
        value           nonuniform List<scalar> 
300
(
4.99873e-07
5.00656e-07
5.01424e-07
5.02178e-07
5.02916e-07
5.03639e-07
5.04348e-07
5.05042e-07
...
)
;
    }
    top
    {
        type            fixedValue;
        value           uniform 0;
    }
    walls
    {
        type            fixedValue;
        value           uniform 0;
    }
    frontAndBackPlanes
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
