Example/SteadyFlow/Sumer1996/0/phia_0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "100";
    object      phia_0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
599
(
-2.66404e-29
-5.2924e-29
-7.927e-29
-1.05739e-28
-1.32256e-28
-1.58843e-28
-1.85481e-28
-2.12189e-28
...
)
;

boundaryField
{
    inandouthalf11
    {
        type            cyclic;
        value           nonuniform List<scalar> 
300
(
-1.67494e-39
-7.31254e-31
-1.31893e-30
-1.85603e-30
-2.44984e-30
-3.05532e-30
-3.6561e-30
-4.25987e-30
...
)
;
    }
    inandouthalf12
    {
        type            cyclic;
        value           nonuniform List<scalar> 
300
(
1.67494e-39
7.31254e-31
1.31893e-30
1.85603e-30
2.44984e-30
3.05532e-30
3.6561e-30
4.25987e-30
...
)
;
    }
    inandouthalf21
    {
        type            cyclic;
        value           nonuniform List<scalar> 
300
(
-4.99873e-07
-5.00656e-07
-5.01424e-07
-5.02178e-07
-5.02916e-07
-5.03639e-07
-5.04348e-07
-5.05042e-07
...
)
;
    }
    inandouthalf22
    {
        type            cyclic;
        value           nonuniform List<scalar> 
300
(
4.99873e-07
5.00656e-07
5.01424e-07
5.02178e-07
5.02916e-07
5.03639e-07
5.04348e-07
5.05042e-07
...
)
;
    }
    top
    {
        type            fixedValue;
        value           uniform 0;
    }
    walls
    {
        type            fixedValue;
        value           uniform 0;
    }
    frontAndBackPlanes
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
