Example/SteadyFlow/Sumer1996/0/phib
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "100";
    object      phib;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
599
(
6.37763e-17
6.40577e-17
6.42156e-17
6.44344e-17
6.46757e-17
6.494e-17
6.51941e-17
6.54663e-17
...
)
;

boundaryField
{
    inandouthalf11
    {
        type            cyclic;
        value           nonuniform List<scalar> 
300
(
-1.08955e-12
-1.07563e-12
-1.07683e-12
-1.07855e-12
-1.07825e-12
-1.07819e-12
-1.07842e-12
-1.07859e-12
...
)
;
    }
    inandouthalf12
    {
        type            cyclic;
        value           nonuniform List<scalar> 
300
(
1.08955e-12
1.07563e-12
1.07683e-12
1.07855e-12
1.07825e-12
1.07819e-12
1.07842e-12
1.07859e-12
...
)
;
    }
    inandouthalf21
    {
        type            cyclic;
        value           nonuniform List<scalar> 
300
(
-4.99982e-07
-5.00767e-07
-5.01538e-07
-5.02294e-07
-5.03035e-07
-5.03762e-07
-5.04473e-07
-5.0517e-07
...
)
;
    }
    inandouthalf22
    {
        type            cyclic;
        value           nonuniform List<scalar> 
300
(
4.99982e-07
5.00767e-07
5.01538e-07
5.02294e-07
5.03035e-07
5.03762e-07
5.04473e-07
5.0517e-07
...
)
;
    }
    top
    {
        type            fixedValue;
        value           uniform 0;
    }
    walls
    {
        type            fixedValue;
        value           uniform 0;
    }
    frontAndBackPlanes
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
