Example/SteadyFlow/Sumer1996/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (0.499 0 0.001)
    (0.501 0 0.001)
    (0.501 0.075 0.001)
    (0.501 0.15 0.001) 
    (0.499 0.15 0.001)
    (0.499 0.075 0.001)

    (0.499 0 -0.001)
    (0.501 0 -0.001)
    (0.501 0.075 -0.001)
    (0.501 0.15 -0.001)
    (0.499 0.15 -0.001)
    (0.499 0.075 -0.001)

);

blocks          
(
    hex (0 1 7 6 5 2 8 11) (1 1 300) simpleGrading (1 1 1)
    hex (5 2 8 11 4 3 9 10) (1 1 300) simpleGrading (1 1 1)
);

edges           
(
);

boundary         
(
    inandouthalf11 
    {
     type   cyclic;
     neighbourPatch inandouthalf12;
     faces ((0 5 11 6));
    }
    inandouthalf12
    {
     type   cyclic;
     neighbourPatch  inandouthalf11;
     faces  ((1 7 8 2));
    }
    inandouthalf21
    {
     type cyclic;
     neighbourPatch  inandouthalf22;
     faces ((5 4 10 11));
    }
    inandouthalf22
    {
     type cyclic;
     neighbourPatch  inandouthalf21;
     faces ((2 8 9 3));
    }
    top
    { 
     type wall;
        faces ((4 3 9 10));
    }
    walls 
    {
     type wall;
     faces ((0 6 7 1)); 
    }
    frontAndBackPlanes
    {
    type empty;
    faces (
           (0 1 2 5)
           (5 2 3 4)
           (6 11 8 7)
           (11 10 9 8)
          );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
