Example/SteadyFlow/Sumer1996/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// * * * * * * * * * * * * * following are for driving force * * * * * * * * * * * * * * //
tilt            tilt [ 0 0 0 0 0 0 0 ] 1; //tiled tube or not?
gradPAMP1        gradPAMP1 [ 1 -2 -2 0 0 0 0 ] ( 0 0 0 );     // pressure osci amp
gradPAMP2        gradPAMP2 [ 1 -2 -2 0 0 0 0 ] ( 0 0 0 );     // pressure osci amp
gradPOSC        gradPOSC [ 1 -2 -2 0 0 0 0 ] ( 46.9899 0 0 );  // pressure osci real value
gradPMEAN       gradPMEAN [ 1 -2 -2 0 0 0 0 ] (46.9899 0 0 );  //mean pressure
oscpT           oscpT [ 0 0 0 0 0 0 0 ] 20;      // osci period
initTheta       initTheta [ 0 0 0 0 0 0 0] 0;    //initial deg

// * * * * * * * * definition of turbulence coefficient and others * * * * * * * * * //
SUS             SUS [ 0 0 0 0 0 0 0 ] 1;  //set to 1 to include turbulent suspension term, else set to 0
C3ep           C3ep [ 0 0 0 0 0 0 0 ] 1.2; //set the coefficient of C3 in epsilon equation */
C4ep           C4ep [ 0 0 0 0 0 0 0 ] 0;
KE1             KE1 [ 0 0 0 0 0 0 0 ] 0;  //density stra (Uf-Us)
KE2             KE2 [ 0 0 0 0 0 0 0 ] 1;  //turb modulation
KE3             KE3 [ 0 0 0 0 0 0 0 ] 0;  //turb generation
KE4             KE4 [ 0 0 0 0 0 0 0 ] 1;  //density stratification g
B               B [ 0 0 0 0 0 0 0 ] 0.15; //turb modulation coeff
alphaMinFriction alphaMinFriction [ 0 0 0 0 0 0 0 ] 0.57;
// * * * * * * * * * * * * end of definition * * * * * * * * * * * * * //

// * * * * * * * * * * fluid and sediment properties * * * * * * * * * //
phasea
{
    rho             rho [ 1 -3 0 0 0 ] 2650;
    nu              nu [ 0 2 -1 0 0 ] 1e-6;
    d               d [ 0 1 0 0 0 0 0 ] 0.00013;
}

phaseb
{
    rho             rho [ 1 -3 0 0 0 ] 1000;
    nu              nu [ 0 2 -1 0 0 ] 1.e-06;
    d               d [ 0 1 0 0 0 0 0 ] 0.00013;
}

Cvm             Cvm [ 0 0 0 0 0 ] 0;

Cl              Cl [ 0 0 0 0 0 ] 0;

Ct              Ct [ 0 0 0 0 0 ] 0;

alphaAlpha      alphaAlpha [ 0 0 0 0 0 ] 0;

// ************************************************************************* //
