Example/SteadyFlow/Sumer1996/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//defaultFieldValues ( volScalarFieldValue alpha 0 );

regions 
(
//      boxToCell 
//      {
//           box ( 0 0 -0.25 ) ( 1.0 0.1 0.25 ) ;
//           fieldValues ( volScalarFieldValue alpha 0.600666667); 
//      }
      boxToCell
      {
           box ( 0 0 -0.25 ) ( 1.0 0.5 0.25 ) ;
           fieldValues ( volVectorFieldValue Ua (0 0 0)) ;
      }
      boxToCell
      {
           box ( 0 0 -0.25 ) ( 1.0 0.5 0.25 ) ;
           fieldValues ( volVectorFieldValue Ub (0 0 0)) ;
      }
);


// ************************************************************************* //
